In [3]:
import pandas as pd
import numpy as np

x = pd.read_csv('initial_marketing_campaign_Task-1.csv') 
print(x.head())

  ID\tYear_Birth\tEducation\tMarital_Status\tIncome\tKidhome\tTeenhome\tDt_Customer\tRecency\tMntWines\tMntFruits\tMntMeatProducts\tMntFishProducts\tMntSweetProducts\tMntGoldProds\tNumDealsPurchases\tNumWebPurchases\tNumCatalogPurchases\tNumStorePurchases\tNumWebVisitsMonth\tAcceptedCmp3\tAcceptedCmp4\tAcceptedCmp5\tAcceptedCmp1\tAcceptedCmp2\tComplain\tZ_CostContact\tZ_Revenue\tResponse
0  5524\t1957\tGraduation\tSingle\t58138\t0\t0\t0...
1  5524\t1954\tGraduation\tSingle\t46344\t1\t1\t0...
2  4141\t1965\tGraduation\tTogether\t71613\t0\t0\...
3  6182\t1984\tGraduation\tTogether\t26646\t1\t0\...
4  5324\t1981\tPhD\tMarried\t58293\t1\t0\t19-01-2...

In [9]:
df = pd.read_csv('initial_marketing_campaign_Task-1.csv', sep="\\t",engine='python')
print(df)

         "ID  Year_Birth   Education Marital_Status   Income  Kidhome  \
0      "5524        1957  Graduation         Single  58138.0        0
1      "5524        1954  Graduation         Single  46344.0        1
2      "4141        1965  Graduation       Together  71613.0        0
3      "6182        1984  Graduation       Together  26646.0        1
4      "5324        1981         PhD        Married  58293.0        1
...      ...         ...         ...            ...      ...      ...
2235  "10870        1967  Graduation        Married  61223.0        0
2236   "4001        1946         PhD       Together  64014.0        2
2237   "7270        1981  Graduation       Divorced  56981.0        0
2238   "8235        1956      Master       Together  69245.0        0
2239   "9405        1954         PhD        Married  52869.0        1

      Teenhome Dt_Customer  Recency  MntWines  ...  NumWebVisitsMonth  \
0            0  04-09-2012       58       635  ...                  7
1            1  08-03-2014       38        11  ...                  5
2            0  21-08-2013       26       426  ...                  4
3            0  10-02-2014       26        11  ...                  6
4            0  19-01-2014       94       173  ...                  5
...        ...         ...      ...       ...  ...                ...
2235         1  13-06-2013       46       709  ...                  5
2236         1  10-06-2014       56       406  ...                  7
2237         0  25-01-2014       91       908  ...                  6
2238         1  24-01-2014        8       428  ...                  3
2239         1  15-10-2012       40        84  ...                  7

      AcceptedCmp3  AcceptedCmp4  AcceptedCmp5  AcceptedCmp1  AcceptedCmp2  \
0                0             0             0             0             0
1                0             0             0             0             0
2                0             0             0             0             0
3                0             0             0             0             0
4                0             0             0             0             0
...            ...           ...           ...           ...           ...
2235             0             0             0             0             0
2236             0             0             0             1             0
2237             0             1             0             0             0
2238             0             0             0             0             0
2239             0             0             0             0             0

      Complain  Z_CostContact  Z_Revenue  Response"
0            0              3         11         1"
1            0              3         11         0"
2            0              3         11         0"
3            0              3         11         0"
4            0              3         11         0"
...        ...            ...        ...        ...
2235         0              3         11         0"
2236         0              3         11         0"
2237         0              3         11         0"
2238         0              3         11         0"
2239         0              3         11         1"

[2240 rows x 29 columns]

#  Step-1 : Identify & handle missing values

In [10]:
df.isnull().sum()

"ID                     0
Year_Birth              0
Education               0
Marital_Status          0
Income                 23
Kidhome                 0
Teenhome                0
Dt_Customer             0
Recency                 0
MntWines                0
MntFruits               0
MntMeatProducts         0
MntFishProducts         0
MntSweetProducts        0
MntGoldProds            0
NumDealsPurchases       0
NumWebPurchases         0
NumCatalogPurchases     0
NumStorePurchases       0
NumWebVisitsMonth       0
AcceptedCmp3            0
AcceptedCmp4            0
AcceptedCmp5            0
AcceptedCmp1            0
AcceptedCmp2            0
Complain                0
Z_CostContact           0
Z_Revenue               0
Response"               0
dtype: int64

In [11]:
df['Income'] = df['Income'].fillna(df['Income'].median())
df.isnull().sum()

"ID                    0
Year_Birth             0
Education              0
Marital_Status         0
Income                 0
Kidhome                0
Teenhome               0
Dt_Customer            0
Recency                0
MntWines               0
MntFruits              0
MntMeatProducts        0
MntFishProducts        0
MntSweetProducts       0
MntGoldProds           0
NumDealsPurchases      0
NumWebPurchases        0
NumCatalogPurchases    0
NumStorePurchases      0
NumWebVisitsMonth      0
AcceptedCmp3           0
AcceptedCmp4           0
AcceptedCmp5           0
AcceptedCmp1           0
AcceptedCmp2           0
Complain               0
Z_CostContact          0
Z_Revenue              0
Response"              0
dtype: int64

# Step-2 : Remove duplicate rows

In [7]:
# Total duplicate rows (excluding the first occurrence)
duplicates_before = df.duplicated().sum()
print("Duplicate rows before:", duplicates_before)

Duplicate rows before: 8

In [12]:
df = df.drop_duplicates()
duplicates_after = df.duplicated().sum()
print("Duplicate rows after:", duplicates_after)

Duplicate rows after: 0

# Step-3 : Standardize text values

In [18]:
df['Marital_Status'] = df['Marital_Status'].str.upper().str.strip()
df.head()

,"""ID",Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,"Response"""
0,"""5524",1957,Graduation,SINGLE,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,"1"""
1,"""5524",1954,Graduation,SINGLE,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,"0"""
2,"""4141",1965,Graduation,TOGETHER,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,"0"""
3,"""6182",1984,Graduation,TOGETHER,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,"0"""
4,"""5324",1981,PhD,MARRIED,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,"0"""

# Step-4 : Convert date formats

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2232 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   "ID                  2232 non-null   object
 1   Year_Birth           2232 non-null   int64
 2   Education            2232 non-null   object
 3   Marital_Status       2232 non-null   object
 4   Income               2232 non-null   float64
 5   Kidhome              2232 non-null   int64
 6   Teenhome             2232 non-null   int64
 7   Dt_Customer          2232 non-null   object
 8   Recency              2232 non-null   int64
 9   MntWines             2232 non-null   int64
 10  MntFruits            2232 non-null   int64
 11  MntMeatProducts      2232 non-null   int64
 12  MntFishProducts      2232 non-null   int64
 13  MntSweetProducts     2232 non-null   int64
 14  MntGoldProds         2232 non-null   int64
 15  NumDealsPurchases    2232 non-null   int64
 16  NumWebPurchases      2232 non-null   int64
 17  NumCatalogPurchases  2232 non-null   int64
 18  NumStorePurchases    2232 non-null   int64
 19  NumWebVisitsMonth    2232 non-null   int64
 20  AcceptedCmp3         2232 non-null   int64
 21  AcceptedCmp4         2232 non-null   int64
 22  AcceptedCmp5         2232 non-null   int64
 23  AcceptedCmp1         2232 non-null   int64
 24  AcceptedCmp2         2232 non-null   int64
 25  Complain             2232 non-null   int64
 26  Z_CostContact        2232 non-null   int64
 27  Z_Revenue            2232 non-null   int64
 28  Response"            2232 non-null   object
dtypes: float64(1), int64(23), object(5)
memory usage: 479.5+ KB

In [8]:
df['Dt_Customer'] = pd.to_datetime(df['Dt_Customer'], format='%d-%m-%Y')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   "ID                  2240 non-null   object
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2240 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   datetime64[ns]
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Z_CostContact        2240 non-null   int64
 27  Z_Revenue            2240 non-null   int64
 28  Response"            2240 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(23), object(4)
memory usage: 472.6+ KB

# Step-5 : Rename column headers

In [29]:
df.head(2)

,"""id",year_birth,education,marital_status,profit,kidhome,teenhome,dt_customer,recency,mntwines,...,numwebvisitsmonth,acceptedcmp3,acceptedcmp4,acceptedcmp5,acceptedcmp1,acceptedcmp2,complain,z_costcontact,z_revenue,"response"""
0,"""5524",1957,Graduation,SINGLE,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,"1"""
1,"""5524",1954,Graduation,SINGLE,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,"0"""

In [33]:
df.rename(columns={'PROFIT': 'Income'}, inplace=True)
df.head(2)

,"""id",year_birth,education,marital_status,Income,kidhome,teenhome,dt_customer,recency,mntwines,...,numwebvisitsmonth,acceptedcmp3,acceptedcmp4,acceptedcmp5,acceptedcmp1,acceptedcmp2,complain,z_costcontact,z_revenue,"response"""
0,"""5524",1957,Graduation,SINGLE,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,"1"""
1,"""5524",1954,Graduation,SINGLE,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,"0"""

# Step-6 : Check & fix data types

In [52]:

print(df.dtypes)

"id                            object
year_birth             datetime64[ns]
education                      object
marital_status                 object
Income                        float64
kidhome                         int64
teenhome                        int64
dt_customer                    object
recency                         int64
mntwines                        int64
mntfruits                       int64
mntmeatproducts                 int64
mntfishproducts                 int64
mntsweetproducts                int64
mntgoldprods                    int64
numdealspurchases               int64
numwebpurchases                 int64
numcatalogpurchases             int64
numstorepurchases               int64
numwebvisitsmonth               int64
acceptedcmp3                    int64
acceptedcmp4                    int64
acceptedcmp5                    int64
acceptedcmp1                    int64
acceptedcmp2                    int64
complain                        int64
z_costcontact                   int64
z_revenue                       int64
response"                      object
dtype: object

In [82]:
df['Income'] = pd.to_numeric(df['Income'], errors='coerce')
df['Income'] = df['Income'].astype('Int64')
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2232 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   "id                  2232 non-null   object
 1   year_birth           0 non-null      object
 2   education            2232 non-null   object
 3   marital_status       2232 non-null   object
 4   Income               2232 non-null   Int64
 5   kidhome              2232 non-null   int64
 6   teenhome             2232 non-null   int64
 7   dt_customer          2232 non-null   object
 8   recency              2232 non-null   int64
 9   mntwines             2232 non-null   int64
 10  mntfruits            2232 non-null   int64
 11  mntmeatproducts      2232 non-null   int64
 12  mntfishproducts      2232 non-null   int64
 13  mntsweetproducts     2232 non-null   int64
 14  mntgoldprods         2232 non-null   int64
 15  numdealspurchases    2232 non-null   int64
 16  numwebpurchases      2232 non-null   int64
 17  numcatalogpurchases  2232 non-null   int64
 18  numstorepurchases    2232 non-null   int64
 19  numwebvisitsmonth    2232 non-null   int64
 20  acceptedcmp3         2232 non-null   int64
 21  acceptedcmp4         2232 non-null   int64
 22  acceptedcmp5         2232 non-null   int64
 23  acceptedcmp1         2232 non-null   int64
 24  acceptedcmp2         2232 non-null   int64
 25  complain             2232 non-null   int64
 26  z_costcontact        2232 non-null   int64
 27  z_revenue            2232 non-null   int64
 28  response"            2232 non-null   object
dtypes: Int64(1), int64(22), object(6)
memory usage: 473.0+ KB